# PaperSizeSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSizeSet Constructor
PaperSizeSet Class See Also
---
Initializes a new instance of the PaperSizeSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PaperSizeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PaperSizeSet()
```

# See Also
PaperSizeSet Class
Autodesk.Revit.DB Namespace